Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: However, we strongly recommend you to write your own `main()` and call `AddGlobalTestEnvironment()` there, as relying on initialization of global variables makes the code harder to read and may cause problems when you register multiple environments from different translation units and the environments have dependencies among them (remember that the compiler doesn't guarantee the order in which global variables from different translation units are initialized).
it_it: Tuttavia, consigliamo vivamente di scrivere il `main()` e di chiamare `AddGlobalTestEnvironment()` lì, poiché fare affidamento sull'inizializzazione delle variabili globali rende il codice più difficile da leggere e potrebbe causare problemi quando si registrano più ambienti da diverse unità di traduzione e gli ambienti hanno dipendenze tra loro (ricordare che il compilatore non garantisce l'ordine in cui vengono inizializzate le variabili globali di diverse unità di traduzione).

source: However, you also want to use FakeFoo for the default behavior, as duplicating it in the mock object is, well, a lot of work.
it_it: Tuttavia, si vuole usare anche FakeFoo per il comportamento di default, poiché duplicarlo nell'oggetto mock richiede molto lavoro.

source: However, you also want to use `FakeFoo` for the default behavior, as duplicating it in the mock object is, well, a lot of work.
it_it: Tuttavia, si vuole usare anche `FakeFoo` per il comportamento di default, poiché duplicarlo nell'oggetto mock richiede molto lavoro.

source: However, you aren't sure why: Is there a typo somewhere in the matchers?
it_it: Tuttavia, non si è sicuri del perché: c'è un errore di battitura da qualche parte nei matcher?

source: However, you should use ASSERT_* if it doesn't make sense to continue when the assertion in question fails.
it_it: Tuttavia, si usa ASSERT_* se non ha senso continuare quando l'asserzione in questione fallisce.

source: However, you should use `ASSERT_*` if it doesn't make sense to continue when the assertion in question fails.
it_it: Tuttavia, si usa `ASSERT_*` se non ha senso continuare quando l'asserzione in questione fallisce.

source: I can't figure out why gMock thinks my expectations are not satisfied.
it_it: Non riesco a capire perché gMock pensi che le mie aspettative non siano soddisfatte.

source: I get a heapcheck failure when using a mock object, but using a real object is fine.
it_it: Ho un errore sul check dell'heap quando utilizzo un oggetto mock, ma usando un oggetto reale va bene.

source: I got a warning "Uninteresting function call encountered - default action taken.." Should I panic?
it_it: Ho ricevuto un warning "Uninteresting function call encountered - default action taken.." Devo andare nel panico?

source: I have a failed test where gMock tells me TWICE that a particular expectation is not satisfied.
it_it: Ho un test fallito in cui gMock mi dice DUE VOLTE che una particolare expectation non è soddisfatta.

source: I have a fixture class FooTest, but TEST_F(FooTest, Bar) gives me error "no matching function for call to `FooTest::FooTest()'".
it_it: Ho una classe fixture FooTest, ma TEST_F(FooTest, Bar) mi dà l'errore "no matching function for call to `FooTest::FooTest()'".

source: I have a fixture class `FooTest`, but `TEST_F(FooTest, Bar)` gives me error ``"no matching function for call to `FooTest::FooTest()'"``.
it_it: Ho una classe fixture `FooTest`, ma `TEST_F(FooTest, Bar)` mi dà l'errore ``"no matching function for call to `FooTest::FooTest()'"``.

source: I have a huge mock class, and Microsoft Visual C++ runs out of memory when compiling it.
it_it: Ho un'enorme classe mock e Microsoft Visual C++ va in "out of memory" durante la compilazione.

source: I have several test suites which share the same test fixture logic; do I have to define a new test fixture class for each of them?
it_it: Abbiamo diverse test suite che condividono la stessa logica della fixture; si deve definire una nuova classe fixture per ognuna di esse?

source: I hope I didn't confuse you more.
it_it: Speriamo di non aver aumentato la confusione.

source: I know it's not a question, but you get an answer for free any way.
it_it: So che non è una domanda, ma riceverai comunque una risposta gratuitamente.

source: I need to test that different implementations of an interface satisfy some common requirements.
it_it: Devo verificare che diverse implementazioni di un'interfaccia soddisfino alcuni requisiti comuni.

source: I use SetArgPointee() in WillOnce(), but gcc complains about "conflicting return type specified".
it_it: Io uso SetArgPointee() in WillOnce(), ma gcc si lamenta di "conflicting return type specified".

source: I want to define a custom action.
it_it: Voglio definire un'azione personalizzata.

source: IMPORTANT: You must **not** ignore the return value of `RUN_ALL_TESTS()`, or you will get a compiler error.
it_it: IMPORTANTE: **Non** si deve ignorare il valore di ritorno di `RUN_ALL_TESTS()` altrimenti si riceve un errore del compilatore.

source: IMPORTANT: You must not ignore the return value of RUN_ALL_TESTS(), or you will get a compiler error.
it_it: IMPORTANTE: Non si deve ignorare il valore di ritorno di RUN_ALL_TESTS() altrimenti si riceve un errore del compilatore.

source: Ideally, you should code to interfaces, whose methods are all pure virtual.
it_it: Idealmente, si dovrebbero codificare le interfacce, i cui metodi sono tutti puramente virtuali.

source: If gMock searches from front to back, this very useful pattern won't be possible.
it_it: Se gMock effettua la ricerca dalla parte anteriore a quella posteriore, questo modello molto utile non sarà possibile.

source: If it leaves the current function via a return statement or by throwing an exception, the death test is considered to have failed.
it_it: Se lascia la funzione corrente tramite un'istruzione return o per un'eccezione, il death test viene considerato fallito.

source: If the invoked function is not interested in some or all of the arguments, it can simply ignore them.
it_it: Se la funzione invocata non è interessata ad alcuni o a tutti gli argomenti, può semplicemente ignorarli.

source: If used in a test fixture SetUp() method, it skips all tests in the corresponding test suite.
it_it: Se utilizzato in un metodo SetUp() di fixture, salta tutti i test nella test suite corrispondente.

source: If we quietly let the call go through without notifying the user, bugs may creep in unnoticed.
it_it: Se lasciamo passare la chiamata senza notificare all'utente, i bug potrebbero insinuarsi inosservati.

source: If you do that, you can easily differentiate calling the method the wrong number of times from calling it with the wrong arguments.
it_it: Facendolo, si può facilmente distinguere la chiamata al metodo per il numero sbagliato di volte dalla chiamata con gli argomenti sbagliati.

source: If you want them to match in a certain order, you need to be explicit.
it_it: Se si vuole che corrispondano in un certo ordine, si deve essere espliciti.

source: If you're using GoogleTest for the first time or need a refresher, we recommend this tutorial as a starting point.
it_it: Se è la prima volta che si usa GoogleTest, o c'è bisogno di un ripasso, consigliamo questo tutorial come punto di partenza.

source: If your test generates textual output itself, it will mix with the GoogleTest output, making it hard to read.
it_it: Se il test genera esso stesso un output testuale, si mescolerà con l'output di GoogleTest, rendendolo difficile da leggere.

source: If **neither** `WillOnce()` **nor** `WillRepeatedly()` is in the `EXPECT_CALL()`, the inferred cardinality is `Times(1)`.
it_it: Se non c'è **né** `WillOnce()` **né** `WillRepeatedly()` nella `EXPECT_CALL()`, la cardinalità dedotta è `Times(1)`.

source: If *`pred`* returns `true` for the given arguments, the assertion succeeds, otherwise the assertion fails.
it_it: Se *`pred`* restituisce `true` per gli argomenti forniti, l'asserzione ha successo, altrimenti fallisce.

source: If *n* is 0, the call should never happen.
it_it: Se *n* è 0, la chiamata non dovrebbe mai avvenire.

source: If Concrete's implementation ever has to change, you don't have to rewrite everywhere it is used.
it_it: Se l'implementazione di Concrete dovesse cambiare, non sarà necessario riscriverla ovunque venga utilizzata.

source: If FooTest has a const non-static data member, then you have to define the default constructor and initialize the const member in the initializer list of the constructor.
it_it: Se FooTest ha un membro dati const non statico, allora si deve definire il costruttore di default e inizializzare il membro const nell'elenco degli inizializzatori del costruttore.

source: If Forward(10) is called three times in a row, the third time it will be an error, as the last matching expectation (#2) has been saturated.
it_it: Se Forward(10) viene chiamato tre volte di seguito, la terza volta si verificherà un errore, poiché l'ultima expectation corrispondente (#2) è stata saturata.

source: If GTEST_FAIL_FAST environment variable or --gtest_fail_fast flag is set, the test runner will stop execution as soon as the first test failure is found.
it_it: Se la variabile di ambiente GTEST_FAIL_FAST o il flag --gtest_fail_fast sono settati, l'esecutore dei test si interromperà non appena viene rilevato il primo errore.

source: If HasFatalFailure() is used outside of TEST() , TEST_F() , or a test fixture, you must add the ::testing::Test:: prefix, as in:
it_it: Se HasFatalFailure() viene utilizzato al di fuori di TEST() , TEST_F() , o di una fixture, si deve aggiungere il prefisso ::testing::Test::, come in:

source: If TestName ends with an _ (say, Bar_), we get TestSuiteName_Bar__Test, which is invalid.
it_it: Se TestName termina con un _ (ad esempio Bar_), otteniamo TestSuiteName_Bar__Test, che non è valido.

source: If TestName starts with an _ (say, _Bar), we get TestSuiteName__Bar_Test, which is invalid.
it_it: Se TestName inizia con un _ (ad esempio _Bar), otteniamo TestSuiteName__Bar_Test, che non è valido.

source: If TestSuiteName ends with an _ (say, Foo_), we get Foo__TestName_Test, which is invalid.
it_it: Se TestSuiteName termina con un _ (ad esempio Foo_), otteniamo Foo__TestName_Test, che non è valido.

source: If TestSuiteName starts with an _ followed by an upper-case letter (say, _Foo), we end up with _Foo_TestName_Test, which is reserved and thus invalid.
it_it: Se TestSuiteName inizia con un _ seguito da una lettera maiuscola (ad esempio _Foo), finiamo con _Foo_TestName_Test, che è riservato e quindi non valido.

source: If neither WillOnce() nor WillRepeatedly() is in the EXPECT_CALL(), the inferred cardinality is Times(1).
it_it: Se non c'è né WillOnce() né WillRepeatedly() nella EXPECT_CALL(), la cardinalità dedotta è Times(1).

source: If statement creates new threads, failures in these threads are ignored.
it_it: Se statement crea nuovi thread, gli errori in questi thread vengono ignorati.

source: If statement creates new threads, failures in these threads are also ignored.
it_it: Se statement crea nuovi thread, anche gli errori in questi thread vengono ignorati.

source: If n is 0, the call should never happen.
it_it: Se n è 0, la chiamata non dovrebbe mai avvenire.

source: If pred returns true for the given arguments, the assertion succeeds, otherwise the assertion fails.
it_it: Se pred restituisce true per gli argomenti forniti, l'asserzione ha successo, altrimenti fallisce.

source: If p is NULL, the match will always fail regardless of the inner matcher.
it_it: Se p è NULL, il match fallirà sempre indipendentemente dal matcher interno.

source: If GetDomainOwner("yahoo.com") is called, it will be an unexpected call, and thus an error.
it_it: Se viene chiamata GetDomainOwner("yahoo.com"), si tratterà di una chiamata inaspettata [unexpected] e quindi di un errore.

source: If Foo ever changes, there is only one copy of MockFoo to change, and only tests that depend on the changed methods need to be fixed.
it_it: Se Foo cambia, c'è solo una copia di MockFoo da modificare e solo i test che dipendono dai metodi modificati devono essere corretti.

source: If i is not in that range, aborts the program.
it_it: Se i non è compreso in quell'intervallo, interrompe [abort] il programma.

source: If i is not in that range, returns NULL.
it_it: Se i non è compreso in quell'intervallo, restituisce NULL.

source: If (matchers...) is omitted, the expectation behaves as if each argument's matcher were a wildcard matcher (_).
it_it: Se (matchers...) viene omesso, la expectation si comporta come se il matcher di ogni argomento fosse un matcher-jolly (_).

source: If (matchers...) is omitted, the behavior is as if each argument's matcher were a wildcard matcher (_).
it_it: Se (matchers...) viene omesso, il comportamento è come se il matcher di ogni argomento fosse un matcher-jolly (_).

source: If `(`*`matchers...`*`)` is omitted, the behavior is as if each argument's matcher were a [wildcard matcher (`_`)](matchers.md#wildcard).
it_it: Se `(`*`matchers...`*`)` viene omesso, la expectation si comporta come se il matcher di ogni argomento fosse un (`_`)](matchers.md#wildcard).

source: If `(`*`matchers...`*`)` is omitted, the expectation behaves as if each argument's matcher were a [wildcard matcher (`_`)](matchers.md#wildcard).
it_it: Se `(`*`matchers...`*`)` viene omesso, la expectation si comporta come se il matcher di ogni argomento fosse un (`_`)](matchers.md#wildcard).

source: If `Concrete`'s implementation ever has to change, you don't have to rewrite everywhere it is used.
it_it: Se l'implementazione di `Concrete` dovesse cambiare, non sarà necessario riscriverla ovunque venga utilizzata.

source: If `FooTest` has a const non-static data member, then you have to define the default constructor *and* initialize the const member in the initializer list of the constructor.
it_it: Se `FooTest` ha un membro dati const non statico, allora si deve definire il costruttore di default *e* inizializzare il membro const nell'elenco degli inizializzatori del costruttore.

source: If `Foo` ever changes, there is only one copy of `MockFoo` to change, and only tests that depend on the changed methods need to be fixed.
it_it: Se `Foo` cambia, c'è solo una copia di `MockFoo` da modificare e solo i test che dipendono dai metodi modificati devono essere corretti.

source: If `Forward(10)` is called three times in a row, the third time it will be an error, as the last matching expectation (#2) has been saturated.
it_it: Se `Forward(10)` viene chiamato tre volte di seguito, la terza volta si verificherà un errore, poiché l'ultima expectation corrispondente (#2) è stata saturata.

source: If `GTEST_FAIL_FAST` environment variable or `--gtest_fail_fast` flag is set, the test runner will stop execution as soon as the first test failure is found.
it_it: Se la variabile di ambiente `GTEST_FAIL_FAST` o il flag `--gtest_fail_fast` sono settati, l'esecutore dei test si interromperà non appena viene rilevato il primo errore.

source: If `GetDomainOwner("yahoo.com")` is called, it will be an unexpected call, and thus an error.
it_it: Se viene chiamata `GetDomainOwner("yahoo.com")`, si tratterà di una chiamata inaspettata [unexpected] e quindi di un errore.

source: If `HasFatalFailure()` is used outside of `TEST()` , `TEST_F()` , or a test fixture, you must add the `::testing::Test::` prefix, as in:
it_it: Se `HasFatalFailure()` viene utilizzato al di fuori di `TEST()` , `TEST_F()` o di una test fixture, si deve aggiungere il prefisso `::testing::Test::`, come in:

source: If `TestName` ends with an `_` (say, `Bar_`), we get `TestSuiteName_Bar__Test`, which is invalid.
it_it: Se `TestName` termina con un `_` (ad esempio `Bar_`), otteniamo `TestSuiteName_Bar__Test`, che non è valido.

source: If `TestName` starts with an `_` (say, `_Bar`), we get `TestSuiteName__Bar_Test`, which is invalid.
it_it: Se `TestName` inizia con un `_` (ad esempio `_Bar`), otteniamo `TestSuiteName__Bar_Test`, che non è valido.

source: If `TestSuiteName` ends with an `_` (say, `Foo_`), we get `Foo__TestName_Test`, which is invalid.
it_it: Se `TestSuiteName` termina con un `_` (ad esempio `Foo_`), otteniamo `Foo__TestName_Test`, che non è valido.

source: If `TestSuiteName` starts with an `_` followed by an upper-case letter (say, `_Foo`), we end up with `_Foo_TestName_Test`, which is reserved and thus invalid.
it_it: Se `TestSuiteName` inizia con un `_` seguito da una lettera maiuscola (ad esempio `_Foo`), finiamo con `_Foo_TestName_Test`, che è riservato e quindi non valido.

source: If `i` is not in that range, aborts the program.
it_it: Se `i` non è compreso in quell'intervallo, interrompe [abort] il programma.

source: If `i` is not in that range, returns `NULL`.
it_it: Se `i` non è compreso in quell'intervallo, restituisce `NULL`.

source: If `p` is `NULL`, the match will always fail regardless of the inner matcher.
it_it: Se `p` è `NULL`, il match fallirà sempre indipendentemente dal matcher interno.

source: If `statement` creates new threads, failures in these threads are also ignored.
it_it: Se `statement` crea nuovi thread, anche gli errori in questi thread vengono ignorati.

source: If `statement` creates new threads, failures in these threads are ignored.
it_it: Se `statement` crea nuovi thread, gli errori in questi thread vengono ignorati.

source: If a call is made out-of-order, it will be an error.
it_it: Se una chiamata viene effettuata fuori ordine, sarà un errore.

source: If a call occurred out-of-order, gMock will report an error.
it_it: Se una chiamata è avvenuta fuori ordine, gMock segnalerà un errore.

source: If a call to this method occurs, you'll see a warning in the test output, but it won't be a failure.
it_it: Se c'è una chiamata a questo metodo, verrà visualizzato un warning nell'output del test, ma non si tratterà di un errore.

source: If a comparison of two wide strings fails, their values will be printed as UTF-8 narrow strings.
it_it: Se il confronto tra due stringhe wide fallisce, i relativi valori verranno stampati come stringhe narrow UTF-8.

source: If a fatal failure happens the subsequent steps will be skipped.
it_it: Se si verifica un errore irreversibile, i passaggi successivi verranno saltati.

source: If a fatal failure occurs, it aborts the current function; otherwise the program continues normally.
it_it: Se avviane una "fatal failure", interrompe la funzione corrente; altrimenti il programma continua normalmente.

source: If a method of mock_foo other than DoThis() is called, you will get a warning.
it_it: Se viene chiamato un metodo di mock_foo diverso da DoThis(), si otterrà un warning.

source: If a method of `mock_foo` other than `DoThis()` is called, you will get a warning.
it_it: Se viene chiamato un metodo di `mock_foo` diverso da `DoThis()`, si otterrà un warning.

source: If a mock function's return type is a reference, you need to use ReturnRef() instead of Return() to return a result:
it_it: Se il tipo di ritorno di una funzione mock è un riferimento, si deve usare ReturnRef() anziché Return() per restituire un risultato:

source: If a mock function's return type is a reference, you need to use `ReturnRef()` instead of `Return()` to return a result:
it_it: Se il tipo di ritorno di una funzione mock è un riferimento, si deve usare `ReturnRef()` anziché `Return()` per restituire un risultato:

source: If a mock method has no EXPECT_CALL spec but is called, we say that it's an "uninteresting call", and the default action (which can be specified using ON_CALL()) of the method will be taken.
it_it: Se un metodo mock non ha specifiche EXPECT_CALL ma viene chiamato, si dice che è una "non interessante" e verrà eseguita l'azione di default (specificabile con ON_CALL()).

source: If a mock method has no `EXPECT_CALL` spec but is called, we say that it's an "uninteresting call", and the default action (which can be specified using `ON_CALL()`) of the method will be taken.
it_it: Se un metodo mock non ha specifiche `EXPECT_CALL` ma viene chiamato, si dice che è una "non interessante" e verrà eseguita l'azione di default (specificabile con `ON_CALL()`).

source: If a mock method is called more than expected or with wrong arguments, you'll get an error immediately.
it_it: Se un metodo mock viene chiamato più volte del previsto o con argomenti sbagliati, si riceverà immediatamente un errore.

source: If a mock method is defined in a base class of T, a failure might not be generated.
it_it: Se un metodo mock è definito in una classe base di T, potrebbe non essere generato un errore.

source: If a mock method is defined in a **base class** of `MockFoo`, the "nice" or "strict" modifier may not affect it, depending on the compiler.
it_it: Se un metodo mock è definito in una **classe base** di `MockFoo`, il modificatore "nice" o "strict" potrebbe non influenzarlo, a seconda del compilatore.

source: If a mock method is defined in a base class of MockFoo, the "nice" or "strict" modifier may not affect it, depending on the compiler.
it_it: Se un metodo mock è definito in una classe base di MockFoo, il modificatore "nice" o "strict" potrebbe non influenzarlo, a seconda del compilatore.

source: If a mock method is defined in a base class of T, a warning might still be generated.
it_it: Se un metodo mock è definito in una classe base di T, potrebbe comunque essere generato un warning.

source: If a mock method is defined in a base class of `T`, a failure might not be generated.
it_it: Se un metodo mock è definito in una classe base di `T`, potrebbe non essere generato un errore.

source: If a mock method is defined in a base class of `T`, a warning might still be generated.
it_it: Se un metodo mock è definito in una classe base di `T`, potrebbe comunque essere generato un warning.

source: If a mock method shouldn't be called at all, explicitly say so:
it_it: Se un metodo mock non deve essere affatto chiamato, lo si dica esplicitamente:

source: If a mock method's return type is a built-in C++ type or pointer, by default it will return 0 when invoked.
it_it: Se il tipo restituito di un metodo mock è un tipo o puntatore C++ nativo, per default restituirà 0 quando richiamato.

source: If a template has multiple parameters, wrap the predicate in parentheses so the macro arguments are parsed correctly:
it_it: Se un template ha più parametri, il predicato va racchiuso tra parentesi in modo che gli argomenti della macro vengano analizzati correttamente:

source: If a test throws a C++ exception or (on Windows) a structured exception (SEH), by default GoogleTest catches it, reports it as a test failure, and continues with the next test method.
it_it: Se un test genera un'eccezione C++ o (su Windows) un'eccezione strutturata (SEH), per default GoogleTest la rileva, la segnala come un errore del test e continua con il metodo di test successivo.

source: If a test crashes or has a failed assertion, then it fails; otherwise it succeeds.
it_it: Se un test va in crash o ha fallisce un'asserzione, allora fail; altrimenti succeed.

source: If a test crashes or has a failed assertion, then it *fails*; otherwise it *succeeds*.
it_it: Se un test va in crash o ha fallisce un'asserzione, allora *fail*; altrimenti *succeeds*.

source: If a test fails with a default mock, it will also fail using a nice mock instead.
it_it: Se un test fallisce con un mock di default, fallirà anche utilizzando un mock "nice".
